---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
source: html/d2eeefcf-b254-c38f-0e56-9d7e287ac340.htm
---
# RevitAPISingleEventArgs Methods

Indicates whether the event is being cancelled.